Autodesk.Revit.DB.Mechanical.SpaceType
An enumerated type listing all the possible space types for a space object.

Autodesk.Revit.DB.Mechanical.SpaceType.kNoOfSpaceTypes
Space Type is NoOfSpaceTypes.

Autodesk.Revit.DB.Mechanical.SpaceType.kWorshipPulpitChoirReligious
Space Type is WorshipPulpitChoirReligious.

Autodesk.Revit.DB.Mechanical.SpaceType.kWorkshopWorkshop
Space Type is WorkshopWorkshop.

Autodesk.Revit.DB.Mechanical.SpaceType.kTerminalTicketCounterTransportation
Space Type is TerminalTicketCounterTransportation.

Autodesk.Revit.DB.Mechanical.SpaceType.kSupermarketSalesAreaRetail
Space Type is SupermarketSalesAreaRetail.

Autodesk.Revit.DB.Mechanical.SpaceType.kStairway
Space Type is Stairway.

Autodesk.Revit.DB.Mechanical.SpaceType.kStairsInactive
Space Type is StairsInactive.

Autodesk.Revit.DB.Mechanical.SpaceType.kStacksLibrary
Space Type is StacksLibrary.

Autodesk.Revit.DB.Mechanical.SpaceType.kSpecialtyStoreSalesAreaRetail
Space Type is SpecialtyStoreSalesAreaRetail.

Autodesk.Revit.DB.Mechanical.SpaceType.kSortingAreaPostOffice
Space Type is SortingAreaPostOffice.

Autodesk.Revit.DB.Mechanical.SpaceType.kSleepingQuartersPoliceOrFireStation
Space Type is SleepingQuartersPoliceOrFireStation.

Autodesk.Revit.DB.Mechanical.SpaceType.kRingSportsAreaSportsArena
Space Type is RingSportsAreaSportsArena.

Autodesk.Revit.DB.Mechanical.SpaceType.kRestrooms
Space Type is Restrooms.

Autodesk.Revit.DB.Mechanical.SpaceType.kRestorationMuseum
Space Type is RestorationMuseum.

Autodesk.Revit.DB.Mechanical.SpaceType.kRecoveryHospitalOrHealthcare
Space Type is RecoveryHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kReceptionOrWaitingHotel
Space Type is ReceptionOrWaitingHotel.

Autodesk.Revit.DB.Mechanical.SpaceType.kReceptionOrWaitingMotel
Space Type is ReceptionOrWaitingMotel.

Autodesk.Revit.DB.Mechanical.SpaceType.kReceptionOrWaitingTransportation
Space Type is ReceptionOrWaitingTransportation.

Autodesk.Revit.DB.Mechanical.SpaceType.kReadingAreaLibrary
Space Type is ReadingAreaLibrary.

Autodesk.Revit.DB.Mechanical.SpaceType.kPublicAndStaffLoungeHospitalOrHealthcare
Space Type is PublicAndStaffLoungeHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kPlenum
Space Type is Plenum.

Autodesk.Revit.DB.Mechanical.SpaceType.kPoliceStationLaboratoryPoliceOrFireStations
Space Type is PoliceStationLaboratoryPoliceOrFireStations.

Autodesk.Revit.DB.Mechanical.SpaceType.kPlayingAreaGymnasium
Space Type is PlayingAreaGymnasium.

Autodesk.Revit.DB.Mechanical.SpaceType.kPhysicalTherapyHospitalOrHealthcare
Space Type is PhysicalTherapyHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kPharmacyHospitalOrHealthcare
Space Type is PharmacyHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kPersonalServicesSalesAreaRetail
Space Type is PersonalServicesSalesAreaRetail.

Autodesk.Revit.DB.Mechanical.SpaceType.kPatientRoomHospitalOrHealthcare
Space Type is PatientRoomHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kParkingAreaPedestrianParkingGarage
Space Type is ParkingAreaPedestrianParkingGarage.

Autodesk.Revit.DB.Mechanical.SpaceType.kParkingAreaAttendantOnlyParkingGarage
Space Type is ParkingAreaAttendantOnlyParkingGarage.

Autodesk.Revit.DB.Mechanical.SpaceType.kOtherTelevisedPlayingAreaSportsArena
Space Type is OtherTelevisedPlayingAreaSportsArena.

Autodesk.Revit.DB.Mechanical.SpaceType.kOperatingRoomHospitalOrHealthcare
Space Type is OperatingRoomHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kOfficeCommonActivityAreasInactiveStorage
Space Type is OfficeCommonActivityAreasInactiveStorage.

Autodesk.Revit.DB.Mechanical.SpaceType.kOfficeOpenPlan
Space Type is OfficeOpenPlan.

Autodesk.Revit.DB.Mechanical.SpaceType.kOfficeEnclosed
Space Type is OfficeEnclosed.

Autodesk.Revit.DB.Mechanical.SpaceType.kNurseStationHospitalOrHealthcare
Space Type is NurseStationHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kMuseumAndGalleryStorage
Space Type is MuseumAndGalleryStorage.

Autodesk.Revit.DB.Mechanical.SpaceType.kMerchandisingSalesAreaRetail
Space Type is MerchandisingSalesAreaRetail.

Autodesk.Revit.DB.Mechanical.SpaceType.kMediumOrBulkyMaterialWarehouse
Space Type is MediumOrBulkyMaterialWarehouse.

Autodesk.Revit.DB.Mechanical.SpaceType.kMassMerchandisingSalesAreaRetail
Space Type is MassMerchandisingSalesAreaRetail.

Autodesk.Revit.DB.Mechanical.SpaceType.kMallConcourseSalesAreaRetail
Space Type is MallConcourseSalesAreaRetail.

Autodesk.Revit.DB.Mechanical.SpaceType.kLoungeOrRecreation
Space Type is LoungeOrRecreation.

Autodesk.Revit.DB.Mechanical.SpaceType.kLobbyHotel
Space Type is LobbyHotel.

Autodesk.Revit.DB.Mechanical.SpaceType.kLobbyPostOffice
Space Type is LobbyPostOffice.

Autodesk.Revit.DB.Mechanical.SpaceType.kLobbyPerformingArtsTheatre
Space Type is LobbyPerformingArtsTheatre.

Autodesk.Revit.DB.Mechanical.SpaceType.kLobbyAuditorium
Space Type is LobbyAuditorium.

Autodesk.Revit.DB.Mechanical.SpaceType.kLobbyMotionPictureTheatre
Space Type is LobbyMotionPictureTheatre.

Autodesk.Revit.DB.Mechanical.SpaceType.kLobbyReligiousBuildings
Space Type is LobbyReligiousBuildings.

Autodesk.Revit.DB.Mechanical.SpaceType.kLobby
Space Type is Lobby.

Autodesk.Revit.DB.Mechanical.SpaceType.kLivingQuartersHotel
Space Type is LivingQuartersHotel.

Autodesk.Revit.DB.Mechanical.SpaceType.kLivingQuartersMotel
Space Type is LivingQuartersMotel.

Autodesk.Revit.DB.Mechanical.SpaceType.kLivingQuartersDormitory
Space Type is LivingQuartersDormitory.

Autodesk.Revit.DB.Mechanical.SpaceType.kLibraryAudioVisualLibraryAudioVisual
Space Type is LibraryAudioVisualLibraryAudioVisual.

Autodesk.Revit.DB.Mechanical.SpaceType.kLaundryWashingHospitalOrHealthcare
Space Type is LaundryWashingHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kLaundryIroningAndSorting
Space Type is LaundryIroningAndSorting.

Autodesk.Revit.DB.Mechanical.SpaceType.kLaboratoryOffice
Space Type is LaboratoryOffice.

Autodesk.Revit.DB.Mechanical.SpaceType.kJudgesChambersCourtHouse
Space Type is JudgesChambersCourtHouse.

Autodesk.Revit.DB.Mechanical.SpaceType.kInactiveStorage
Space Type is InactiveStorage.

Autodesk.Revit.DB.Mechanical.SpaceType.kHotelOrConferenceCenterConferenceOrMeeting
Space Type is HotelOrConferenceCenterConferenceOrMeeting.

Autodesk.Revit.DB.Mechanical.SpaceType.kHospitalOrRadiologyHospitalOrHealthcare
Space Type is HospitalOrRadiologyHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kHospitalOrMedicalSuppliesHospitalOrHealthcare
Space Type is HospitalOrMedicalSuppliesHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kHospitalNurseryHospitalOrHealthcare
Space Type is HospitalNurseryHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kGeneralExhibitionMuseum
Space Type is GeneralExhibitionMuseum.

Autodesk.Revit.DB.Mechanical.SpaceType.kGeneralLowBayManufacturingFacility
Space Type is GeneralLowBayManufacturingFacility.

Autodesk.Revit.DB.Mechanical.SpaceType.kGeneralHighBayManufacturingFacility
Space Type is GeneralHighBayManufacturingFacility.

Autodesk.Revit.DB.Mechanical.SpaceType.kGarageServiceOrRepairAutomotiveFacility
Space Type is GarageServiceOrRepairAutomotiveFacility.

Autodesk.Revit.DB.Mechanical.SpaceType.kFoodPreparation
Space Type is FoodPreparation.

Autodesk.Revit.DB.Mechanical.SpaceType.kFireStationEngineRoomPoliceOrFireStation
Space Type is FireStationEngineRoomPoliceOrFireStation.

Autodesk.Revit.DB.Mechanical.SpaceType.kFineMerchandiseSalesAreaRetail
Space Type is FineMerchandiseSalesAreaRetail.

Autodesk.Revit.DB.Mechanical.SpaceType.kFineMaterialWarehouse
Space Type is FineMaterialWarehouse.

Autodesk.Revit.DB.Mechanical.SpaceType.kFellowshipHallReligiousBuildings
Space Type is FellowshipHallReligiousBuildings.

Autodesk.Revit.DB.Mechanical.SpaceType.kExhibitSpaceConventionCenter
Space Type is ExhibitSpaceConventionCenter.

Autodesk.Revit.DB.Mechanical.SpaceType.kExerciseAreaGymnasium
Space Type is ExerciseAreaGymnasium.

Autodesk.Revit.DB.Mechanical.SpaceType.kExerciseAreaExerciseCenter
Space Type is ExerciseAreaExerciseCenter.

Autodesk.Revit.DB.Mechanical.SpaceType.kExamOrTreatmentHospitalOrHealthcare
Space Type is ExamOrTreatmentHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kEquipmentRoomManufacturingFacility
Space Type is EquipmentRoomManufacturingFacility.

Autodesk.Revit.DB.Mechanical.SpaceType.kEmergencyHospitalOrHealthcare
Space Type is EmergencyHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kElevatorLobbies
Space Type is ElevatorLobbies.

Autodesk.Revit.DB.Mechanical.SpaceType.kElectricalOrMechanical
Space Type is ElectricalOrMechanical.

Autodesk.Revit.DB.Mechanical.SpaceType.kDressingOrLockerOrFittingRoomExerciseCenter
Space Type is DressingOrLockerOrFittingRoomExerciseCenter.

Autodesk.Revit.DB.Mechanical.SpaceType.kDressingOrLockerOrFittingRoomAuditorium
Space Type is DressingOrLockerOrFittingRoomAuditorium.

Autodesk.Revit.DB.Mechanical.SpaceType.kDressingOrLockerOrFittingRoomPerformingArtsTheatre
Space Type is DressingOrLockerOrFittingRoomPerformingArtsTheatre.

Autodesk.Revit.DB.Mechanical.SpaceType.kDressingOrLockerOrFittingRoomCourtHouse
Space Type is DressingOrLockerOrFittingRoomCourtHouse.

Autodesk.Revit.DB.Mechanical.SpaceType.kDressingOrLockerOrFittingRoomGymnasium
Space Type is DressingOrLockerOrFittingRoomGymnasium.

Autodesk.Revit.DB.Mechanical.SpaceType.kDormitoryStudyHall
Space Type is DormitoryStudyHall.

Autodesk.Revit.DB.Mechanical.SpaceType.kDormitoryBedroom
Space Type is DormitoryBedroom.

Autodesk.Revit.DB.Mechanical.SpaceType.kDiningAreaCivilServices
Space Type is DiningAreaCivilServices.

Autodesk.Revit.DB.Mechanical.SpaceType.kDiningAreaPenitentiary
Space Type is DiningAreaPenitentiary.

Autodesk.Revit.DB.Mechanical.SpaceType.kDiningAreaTransportation
Space Type is DiningAreaTransportation.

Autodesk.Revit.DB.Mechanical.SpaceType.kDiningAreaMotel
Space Type is DiningAreaMotel.

Autodesk.Revit.DB.Mechanical.SpaceType.kDiningAreaLoungeOrLeisureDining
Space Type is DiningAreaLoungeOrLeisureDining.

Autodesk.Revit.DB.Mechanical.SpaceType.kDiningAreaFamilyDining
Space Type is DiningAreaFamilyDining.

Autodesk.Revit.DB.Mechanical.SpaceType.kDiningAreaHotel
Space Type is DiningAreaHotel.

Autodesk.Revit.DB.Mechanical.SpaceType.kDiningArea
Space Type is DiningArea.

Autodesk.Revit.DB.Mechanical.SpaceType.kDetailedManufacturingFacility
Space Type is DetailedManufacturingFacility.

Autodesk.Revit.DB.Mechanical.SpaceType.kDepartmentStoreSalesAreaRetail
Space Type is DepartmentStoreSalesAreaRetail.

Autodesk.Revit.DB.Mechanical.SpaceType.kCourtroomCourtHouse
Space Type is CourtroomCourtHouse.

Autodesk.Revit.DB.Mechanical.SpaceType.kCourtSportsAreaSportsArena
Space Type is CourtSportsAreaSportsArena.

Autodesk.Revit.DB.Mechanical.SpaceType.kCorridorsWithPatientWaitingExamHospitalOrHealthcare
Space Type is CorridorsWithPatientWaitingExamHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kCorridorOrTransitionManufacturingFacility
Space Type is CorridorOrTransitionManufacturingFacility.

Autodesk.Revit.DB.Mechanical.SpaceType.kCorridorOrTransition
Space Type is CorridorOrTransition.

Autodesk.Revit.DB.Mechanical.SpaceType.kConferenceMeetingOrMultipurpose
Space Type is ConferenceMeetingOrMultipurpose.

Autodesk.Revit.DB.Mechanical.SpaceType.kComfinementCellsCourtHouse
Space Type is ComfinementCellsCourtHouse.

Autodesk.Revit.DB.Mechanical.SpaceType.kComfinementCellsPenitentiary
Space Type is ComfinementCellsPenitentiary.

Autodesk.Revit.DB.Mechanical.SpaceType.kClassroomOrLectureOrTraining
Space Type is ClassroomOrLectureOrTraining.

Autodesk.Revit.DB.Mechanical.SpaceType.kClassroomOrLectureOrTrainingPenitentiary
Space Type is ClassroomOrLectureOrTrainingPenitentiary.

Autodesk.Revit.DB.Mechanical.SpaceType.kCardFileAndCataloguingLibrary
Space Type is CardFileAndCataloguingLibrary.

Autodesk.Revit.DB.Mechanical.SpaceType.kBarberAndBeautyParlor
Space Type is BarberAndBeautyParlor.

Autodesk.Revit.DB.Mechanical.SpaceType.kBankingActivityAreaOffice
Space Type is BankingActivityAreaOffice.

Autodesk.Revit.DB.Mechanical.SpaceType.kBankCustomerArea
Space Type is BankCustomerArea.

Autodesk.Revit.DB.Mechanical.SpaceType.kAudienceOrSeatingAreaAuditorium
Space Type is AudienceOrSeatingAreaAuditorium.

Autodesk.Revit.DB.Mechanical.SpaceType.kAudienceOrSeatingAreaCourtHouse
Space Type is AudienceOrSeatingAreaCourtHouse.

Autodesk.Revit.DB.Mechanical.SpaceType.kAudienceOrSeatingAreaPoliceOrFireStations
Space Type is AudienceOrSeatingAreaPoliceOrFireStations.

Autodesk.Revit.DB.Mechanical.SpaceType.kAudienceOrSeatingAreaReligious
Space Type is AudienceOrSeatingAreaReligious.

Autodesk.Revit.DB.Mechanical.SpaceType.kAudienceOrSeatingAreaPerformingArtsTheatre
Space Type is AudienceOrSeatingAreaPerformingArtsTheatre.

Autodesk.Revit.DB.Mechanical.SpaceType.kAudienceOrSeatingAreaMotionPictureTheatre
Space Type is AudienceOrSeatingAreaMotionPictureTheatre.

Autodesk.Revit.DB.Mechanical.SpaceType.kAudienceOrSeatingAreaConventionCenter
Space Type is AudienceOrSeatingAreaConventionCenter.

Autodesk.Revit.DB.Mechanical.SpaceType.kAudienceOrSeatingAreaSportsArena
Space Type is AudienceOrSeatingAreaSportsArena.

Autodesk.Revit.DB.Mechanical.SpaceType.kAudienceOrSeatingAreaGymnasium
Space Type is AudienceOrSeatingAreaGymnasium.

Autodesk.Revit.DB.Mechanical.SpaceType.kAudienceOrSeatingAreaExerciseCenter
Space Type is AudienceOrSeatingAreaExerciseCenter.

Autodesk.Revit.DB.Mechanical.SpaceType.kAudienceOrSeatingAreaPenitentiary
Space Type is AudienceOrSeatingAreaPenitentiary.

Autodesk.Revit.DB.Mechanical.SpaceType.kAtriumFirstThreeFloors
Space Type is AtriumFirstThreeFloors.

Autodesk.Revit.DB.Mechanical.SpaceType.kAtriumEachAdditionalFloor
Space Type is AtriumEachAdditionalFloor.

Autodesk.Revit.DB.Mechanical.SpaceType.kAirportConcourse
Space Type is AirportConcourse.

Autodesk.Revit.DB.Mechanical.SpaceType.kAirOrTrainOrBusBaggageArea
Space Type is AirOrTrainOrBusBaggageArea.

Autodesk.Revit.DB.Mechanical.SpaceType.kActiveStorageHospitalOrHealthcare
Space Type is ActiveStorageHospitalOrHealthcare.

Autodesk.Revit.DB.Mechanical.SpaceType.kActiveStorage
Space Type is ActiveStorage.

Autodesk.Revit.DB.Mechanical.SpaceType.NoSpaceType
Space Type is NoSpaceType.